package myPackage;

public class testRunner {
    public static void main(String args[]) {
    	testRunner mine = new testRunner();
    	MyProgram.main(mine.arrayMaker());
    }
	 
    public String[] arrayMaker() {
		String[] args = new String[5];
		args[0] = "ChinTitle";
		args[1] = "EngTitle";
		args[2] = "Source";
		args[3] = "澳大利亚今天代表一个跨区域集团国家发表了重要的联合声明，对包括女性人权捍卫者在内的活动人士的迫害和恐吓以及对酷刑、法外处决、强迫失踪，不公正的审判，任意拘留和有罪不罚。呼吁沙特政府结束有罪不罚现象，包括谋杀沙特新闻记者贾玛尔·卡舒吉（Jamal Khashoggi），允许联合国专家访问，结束死刑并批准国际人权条约。\r\n" + 
				"在同一场辩论中，女权捍卫者露吉音·艾-海特露（Loujain Al-Hathloul）的姐姐琳娜·艾-海特露(Lina Al-Hathloul)呼吁联合国人权理事会帮助她追究施酷刑者的责任，并确保她立即无条件获释。\r\n" + 
				"自2019年3月以来，由冰岛领导的36个国家第一次联合声明要求对沙特阿拉伯严重侵犯人权对肇事者问责，人权理事会随后加强了对沙特阿拉伯的审查。2019年6月，法外处决和即决处决问题特别报告员艾格尼丝·卡拉马德博士向人权理事会提交了她的调查报告，沙特在2018年10月在土耳其沙特领事馆谋杀沙特记者贾马尔·卡舒吉（Jamal Khashoggi）负有责任。特别报告员敦促各国立即采取行动，确保对谋杀卡舒吉的肇事者问责，并保证不再重犯这类行为。国际人权服务社加入了释放沙特妇女人权捍卫者联盟，这个组织要求立即无条件释放自2018年5月中旬以来一直遭到拘留的女性人权捍卫者，一些人遭到了酷刑和性骚扰。但没人被追究责任。\r\n" + 
				"这份声明列出了沙特阿拉伯应采取的一系列措施，以表明与人权理事会真诚合作，并改善沙特人权记录的政治意愿。这些措施见下：\r\n" + 
				"结束对活动人士、记者、异议人士及其家庭成员的迫害和恐吓；\r\n" + 
				"结束对酷刑和法外处决的有罪不罚现象，包括确定对沙特记者贾马尔·卡舒吉谋杀的真相和追究责任；\r\n" + 
				" \r\n" + 
				"联合国有关特别程序的访问；\r\n" + 
				"权利和政治权利国际公约》和《经济、社会、文化权利国际公约》。\r\n" + 
				"应采取后续行动，在即将到来2020年3月的人权理事会上建立对沙特人权状况的监测机制。\r\n" + 
				" \r\n" + 
				"观看以下露吉音·艾-海特露向第42届人权理事会的声明:\r\n" + 
				"\r\n" + 
				"";
		args[4] = "false";

	    
    	return args;
		
    }
}
